# Экзамен по курсу "Аналитика данных на Python"

Этот тест проверит Ваши навыки работы с таблицами данных с помощью библиотек pandas и numpy. Задания делятся на простые (⭐️), средние (⭐️⭐️) и сложные (⭐️⭐️⭐️). Решение простых заданий, как правило, требует одной-двух операций с таблицами, тогда как для более сложных может потребоваться несколько последовательных преобразований данных.

##  Предыстория

Сегодня Ваш первый день работы в крупном интернет-магазине, который продаёт товары с доставкой по всему миру. Ваша первая задача – проанализировать базу данных покупок, совершённых в магазине за последние несколько лет. База содержит информацию об отдельных транзакциях, про каждую из которых известны номер инвойса (InvoiceNo), дата инвойса(InvoiceDate), код товара (StockCode), описание товара(Description), количество товара в транзакции (Quantity), стоимость единицы товара (UnitPrice), код покупателя (CustomerID), страна покупателя (Country).

База выгружена для Вас в формате CSV: файл [```online-retail.csv```](https://drive.google.com/file/d/1O1oJtpEu-u6s6xTu7seQfnNcQjYCt0GF/view?usp=sharing)

In [499]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

## ⭐️ Вопрос 1

Загрузите данные из файла online-retail.csv в переменную типа pandas DataFrame

Подсказка: Используйте функцию из библиотеки pandas

Какой символ-разделитель используется в этом файле?

* Запятая ","
* Двоеточие ":"
* Точка с запятой ";"
* Символ табуляции "tab"

#### Решение

In [500]:
df = pd.read_csv('/Users/Arcry/SkillBox/files/online-retail.csv', sep=';', parse_dates=['InvoiceDate'], dayfirst=True)
df['InvoiceDate']

0        2010-12-01 08:26:00
1        2010-12-01 08:26:00
2        2010-12-01 08:26:00
3        2010-12-01 08:26:00
4        2010-12-01 08:26:00
                 ...
541906   2011-12-09 12:50:00
541907   2011-12-09 12:50:00
541908   2011-12-09 12:50:00
541909   2011-12-09 12:52:00
541910   2011-12-09 12:52:00
Name: InvoiceDate, Length: 541911, dtype: datetime64[ns]

In [501]:
# sep=';'

## ⭐️ Вопрос 2

Сколько строк в полученной таблице (не считая заголовков столбцов)?

#### Решение

In [502]:
len(df.index)

541911

## ⭐️ Вопрос 3

Сколько столбцов в полученной таблице (не считая индекса)?

#### Решение

In [503]:
len(df.columns)

8

## ⭐️ Вопрос 4

Как называется столбец с самым коротким названием?

#### Решение

In [504]:
min(df.columns)

'Country'

## ⭐️ Вопрос 5

В скольких столбцах встречаются пропущенные значения? (ответ - целое число)

#### Решение

In [505]:
df.isna().sum()

InvoiceNo           0
StockCode           0
Description      1455
Quantity            0
InvoiceDate         0
UnitPrice           0
CustomerID     135080
Country             0
dtype: int64

In [506]:
#2

## ⭐️ Вопрос 6

Сколько пропущенных значений в столбце CustomerID? (ответ - целое число)

#### Решение

In [507]:
df['CustomerID'].isna().sum()

135080

## ⭐️⭐️ Вопрос 7

Посмотрим, данные за какой исторический период у нас есть. 

Данные за какой самый ранний и за какой самый поздний годы содержатся в датасете? В ответе укажите два целых числа через запятую.

#### Решение

In [508]:
pd.DatetimeIndex(df['InvoiceDate']).year.min()

2010

In [509]:
pd.DatetimeIndex(df['InvoiceDate']).year.max()

2011

## ⭐️ Вопрос 8

Каковы минимальная и максимальная цена товаров (UnitPrice)? Перечислите через запятую. Цена в этом задании может принимать отрицательные значения.

#### Решение

In [510]:
df['UnitPrice'].min()

-11062.06

In [284]:
df['UnitPrice'].max()

38970.0

## ⭐️ Вопрос 9

В таблице оказались товары с отрицательными ценами! Это явно какая-то ошибка. Какое описание (Description) у таких транзакций? Перечислите все варианты через запятую, отсортировав строки по алфавиту.

#### Решение

In [512]:
df[df['UnitPrice'] < 0]

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
299983,A563186,B,Adjust bad debt,1,2011-08-12 14:51:00,-11062.06,NaN,United Kingdom
299984,A563187,B,Adjust bad debt,1,2011-08-12 14:52:00,-11062.06,NaN,United Kingdom

## ⭐️ Вопрос 10

Поищем ещё возможные проблемы с данными. Как насчёт товаров с нулевыми ценами? 

Сколько в таблице транзакций с нулевой ценой? А с пропусками на месте цены? 

Перечислите два целых числа через запятую.

#### Решение

In [514]:
df[df['UnitPrice'] == 0].index

Int64Index([   622,   1970,   1971,   1972,   1987,   1988,   2024,   2025,
              2026,   2406,
            ...
            535333, 535334, 535335, 535336, 536908, 536981, 538504, 538505,
            538554, 538919],
           dtype='int64', length=2515)

In [287]:
df.isna().sum()

InvoiceNo           0
StockCode           0
Description      1455
Quantity            0
InvoiceDate         0
UnitPrice           0
CustomerID     135080
Country             0
dtype: int64

## ⭐️⭐️ Вопрос 11

Для дальнейшего анализа поведения покупателей нам понадобится набор данных, в которых у каждой транзакции корректно указана цена, количество единиц товара (Quantity) и id покупателя (CustomerID). Удалите из таблицы все строки, в которых цена не превосходит 0 или пропущена, или количество единиц товара не превосходит 0 или пропущено, или в которых пропущен id покупателя. 

Сколько строк осталось?

#### Решение

In [288]:
df_clean = df.dropna(subset=['CustomerID'])

In [289]:
df_clean.drop(df_clean[df_clean['Quantity']<0].index, inplace=True)

c:\users\arcry\anaconda3\lib\site-packages\pandas\core\frame.py:4163: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(

In [290]:
df_clean.drop(df_clean[df_clean['UnitPrice']<0].index, inplace=True)

c:\users\arcry\anaconda3\lib\site-packages\pandas\core\frame.py:4163: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(

In [291]:
len(df_clean.index)

397926

## Внимание! 

### Везде далее мы работаем с очищенной таблицей, полученной в Вопросе 11.

## ⭐️⭐️ Вопрос 12

В таблице для каждой транзакции указаны цена за единицу товара (UnitPrice) и количество единиц товара (Quantity). Вычислите для каждой транзакции её **полную стоимость** и сохраните в новом столбце Price, который добавьте в таблицу. 

Каковы минимальная и максимальная полная стоимость транзакций? Перечислите через запятую, округлив до целых чисел.

#### Решение

In [292]:
df_clean['Price'] = df_clean['UnitPrice']*df_clean['Quantity']

<ipython-input-292-5c2ab36ae17f>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_clean['Price'] = df_clean['UnitPrice']*df_clean['Quantity']

In [293]:
df_clean.head(10)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,Price
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom,15.30
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20.34
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom,22.00
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20.34
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20.34
5,536365,22752,SET 7 BABUSHKA NESTING BOXES,2,2010-12-01 08:26:00,7.65,17850.0,United Kingdom,15.30
6,536365,21730,GLASS STAR FROSTED T-LIGHT HOLDER,6,2010-12-01 08:26:00,4.25,17850.0,United Kingdom,25.50
7,536366,22633,HAND WARMER UNION JACK,6,2010-12-01 08:28:00,1.85,17850.0,United Kingdom,11.10
8,536366,22632,HAND WARMER RED POLKA DOT,6,2010-12-01 08:28:00,1.85,17850.0,United Kingdom,11.10
9,536367,84879,ASSORTED COLOUR BIRD ORNAMENT,32,2010-12-01 08:34:00,1.69,13047.0,United Kingdom,54.08

In [294]:
df_clean['Price'].max()

168469.6

In [295]:
df_clean['Price'].min()

0.0

## ⭐️⭐️ Вопрос 13

В нашей базе данных каждая покупка представлена одной или несколькими транзакциями. Покупка однозначно определяется своим номером инвойса (InvoiceNo). Транзакции, относящиеся к одной покупке, имеют один и тот же InvoiceNo. 

Стоимость всей покупки равна сумме полных стоимостей транзакций, входящих в неё. Найдите стоимости трёх самых дорогих покупок. Перечислите через запятую в порядке убывания, округлив до целых чисел.

#### Решение

In [522]:
df_clean.groupby('InvoiceNo').sum().sort_values('Price', ascending=False).head(3)

           Quantity  UnitPrice  CustomerID     Price
InvoiceNo
581483        80995       2.08     16446.0  168469.6
541431        74215       1.04     12346.0   77183.6
556444           60     649.50     15098.0   38970.0

## ⭐️⭐️ Вопрос 14

Какой товар составил наибольшую выручку? В ответе укажите описание товара (дословно строку из соответствующего поля в столбце Description).

#### Решение

In [297]:
df_clean.groupby('StockCode').sum().sort_values('Price', ascending=False).reset_index()

     StockCode  Quantity  UnitPrice  CustomerID       Price
0        23843     80995      2.080     16446.0  168469.600
1        22423     12412  21508.900  25806890.0  142592.950
2       85123A     36782   5887.470  31667793.0  100603.500
3       85099B     46181   3261.690  24748363.0   85220.780
4        23166     77916    241.620   3047321.0   81416.730
...        ...       ...        ...         ...         ...
3660     90084         1      0.850     14701.0       0.850
3661     90104         1      0.850     17961.0       0.850
3662     21268         2      0.420     15574.0       0.840
3663     84227         1      0.420     17841.0       0.420
3664      PADS         4      0.003     61901.0       0.003

[3665 rows x 5 columns]

In [298]:
df_clean[df['StockCode'] == '23843']

<ipython-input-298-becda0b26f3d>:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  df_clean[df['StockCode'] == '23843']

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,Price
540421,581483,23843,"PAPER CRAFT , LITTLE BIRDIE",80995,2011-12-09 09:15:00,2.08,16446.0,United Kingdom,168469.6

## ⭐️⭐️ Вопрос 15

Создайте новую таблицу purchases, в которой каждая строка будет соответствовать отдельной покупке, со столбцами 
InvoiceNo, InvoiceDate, Price, CustomerID, Country.

Поскольку дата InvoiceDate может быть отличаться для разных транзакций внутри одной покупки, при группировке возьмите самую раннюю из дат. Также отсортируйте её по датам по возрастанию.

Сколько получилось строк?

#### Решение

In [299]:
purchases = df_clean.groupby('InvoiceNo').agg({'InvoiceDate' : np.min, 'Price': np.sum\
                                               , 'CustomerID': pd.Series.unique\
                                               , 'Country': pd.Series.unique}).reset_index()

In [300]:
purchases.head()

  InvoiceNo         InvoiceDate   Price  CustomerID         Country
0    536365 2010-12-01 08:26:00  139.12     17850.0  United Kingdom
1    536366 2010-12-01 08:28:00   22.20     17850.0  United Kingdom
2    536367 2010-12-01 08:34:00  278.73     13047.0  United Kingdom
3    536368 2010-12-01 08:34:00   70.05     13047.0  United Kingdom
4    536369 2010-12-01 08:35:00   17.85     13047.0  United Kingdom

In [301]:
len(purchases.index)

18537

## ⭐️⭐️ Вопрос 16

Исследуем, растут или убывают покупки наших клиентов после их первой покупки на сайте.
Найдите среднюю цену первых покупок клиентов: для каждого клиента возьмите его первую покупку и усредните эти значения. Найдите среднюю цену покупок в целом. Округлите эти числа до целых и перечислите в этом порядке через запятую.

#### Решение

In [524]:
purchases.groupby('CustomerID').agg({'InvoiceDate' : np.min}).merge(purchases, how='left'\
                                                                    , left_on=['CustomerID'\
                                                                               ,'InvoiceDate']\
                                                                    , right_on=['CustomerID','InvoiceDate'])

,CustomerID,InvoiceDate,InvoiceNo,Price,Country,DayOfWeek,Month,Year
0,12346.0,2011-01-18 10:01:00,541431,77183.60,United Kingdom,1,1,2011
1,12347.0,2010-12-07 14:57:00,537626,711.79,Iceland,1,12,2010
2,12348.0,2010-12-16 19:09:00,539318,892.80,Finland,3,12,2010
3,12349.0,2011-11-21 09:51:00,577609,1757.55,Italy,0,11,2011
4,12350.0,2011-02-02 16:01:00,543037,334.40,Norway,2,2,2011
...,...,...,...,...,...,...,...,...
4348,18280.0,2011-03-07 09:52:00,545712,180.60,United Kingdom,0,3,2011
4349,18281.0,2011-06-12 10:53:00,556464,80.82,United Kingdom,6,6,2011
4350,18282.0,2011-08-05 13:35:00,562525,100.21,United Kingdom,4,8,2011
4351,18283.0,2011-01-06 14:14:00,540350,108.45,United Kingdom,3,1,2011
4352,18287.0,2011-05-22 10:39:00,554065,765.28,United Kingdom,6,5,2011

In [303]:
purchases.groupby('CustomerID').agg({'InvoiceDate' : np.min}).merge(purchases, how='left'\
                                                                    , left_on=['CustomerID'\
                                                                               ,'InvoiceDate']\
                                                                    , right_on=['CustomerID','InvoiceDate'])['Price']\
                                                                    .mean()

424.5775931541458

In [304]:
purchases['Price'].mean()

480.7382912013795

## ⭐️⭐️⭐️ Вопрос 17

В какой день недели было наибольшее число покупок? В ответе укажите русское название дня недели, начинающееся с заглавной буквы.


Подсказка: 
* Преобразуйте тип данных в столбце InvoiceDate таблицы purchases из строк в datetime. 
* Для каждой покупки вычислите день недели, в который она была совершена. Сохраните в новый столбец.
* Сгруппируйте таблицу по дням недели.

#### Решение

In [306]:
purchases['DayOfWeek'] = pd.DatetimeIndex(purchases['InvoiceDate']).dayofweek
purchases.head()

  InvoiceNo         InvoiceDate   Price  CustomerID         Country  DayOfWeek
0    536365 2010-12-01 08:26:00  139.12     17850.0  United Kingdom          2
1    536366 2010-12-01 08:28:00   22.20     17850.0  United Kingdom          2
2    536367 2010-12-01 08:34:00  278.73     13047.0  United Kingdom          2
3    536368 2010-12-01 08:34:00   70.05     13047.0  United Kingdom          2
4    536369 2010-12-01 08:35:00   17.85     13047.0  United Kingdom          2

In [319]:
purchases.groupby('DayOfWeek')['Price'].count().sort_values(ascending=False)

DayOfWeek
3    4033
2    3455
1    3185
0    2863
4    2832
6    2169
Name: Price, dtype: int64

In [315]:
purchases['DayOfWeek'].value_counts()

3    4033
2    3455
1    3185
0    2863
4    2832
6    2169
Name: DayOfWeek, dtype: int64

In [ ]:
#Четверг

## ⭐️⭐️⭐️ Вопрос 18

В какой год и месяц выручка была максимальной?

Подсказка: 
* Преобразуйте тип данных в столбце InvoiceDate таблицы purchases из строк в datetime. 
* Для каждой покупки вычислите год и месяц, в которые она была совершена. Сохраните в новые столбцы.
* Сгруппируйте таблицу по новым столбцам

В ответе укажите два целых числа через запятую: год, месяц

#### Решение

In [320]:
purchases['Month'] = pd.DatetimeIndex(purchases['InvoiceDate']).month
purchases['Year'] = pd.DatetimeIndex(purchases['InvoiceDate']).year
purchases.head()

,InvoiceNo,InvoiceDate,Price,CustomerID,Country,DayOfWeek,Month,Year
0,536365,2010-12-01 08:26:00,139.12,17850.0,United Kingdom,2,12,2010
1,536366,2010-12-01 08:28:00,22.20,17850.0,United Kingdom,2,12,2010
2,536367,2010-12-01 08:34:00,278.73,13047.0,United Kingdom,2,12,2010
3,536368,2010-12-01 08:34:00,70.05,13047.0,United Kingdom,2,12,2010
4,536369,2010-12-01 08:35:00,17.85,13047.0,United Kingdom,2,12,2010

In [336]:
purchases.groupby(['Year','Month']).max('Price').sort_values('Price', ascending=False).reset_index()

    Year  Month      Price  CustomerID  DayOfWeek
0   2011     12  168469.60     18283.0          6
1   2011      1   77183.60     18283.0          6
2   2011      6   38970.00     18283.0          6
3   2011      9   31698.16     18283.0          6
4   2011     10   22206.00     18287.0          6
5   2011      8   21880.44     18282.0          6
6   2011      4   21535.90     18283.0          6
7   2011      3   16726.84     18280.0          6
8   2010     12   15885.49     18269.0          6
9   2011      5   14415.74     18287.0          6
10  2011      2   14022.92     18283.0          6
11  2011      7   13464.26     18283.0          6
12  2011     11   10584.77     18283.0          6

In [ ]:
#2011,12

## ⭐️⭐️⭐️ Вопрос 19

Магазин продаёт товары покупателям из разных стран (Country). В какой стране был наибольший процентный рост месячных продаж, если сравнить март 2011 и сентябрь 2011? Сколько процентов составил этот рост? В расчёт брать только страны, в которых были ненулевые продажи в обоих этих месяцах. В ответе укажите через запятую название страны и целое число (процентный рост, округлённый до целого числа).

#### Решение

In [395]:
purchases_nn = purchases.groupby(['Country','Year','Month']).agg({'Price': np.max}).reset_index()
purchases_nn

         Country  Year  Month     Price
0      Australia  2010     12    415.70
1      Australia  2011      1   7011.38
2      Australia  2011      2  14022.92
3      Australia  2011      3  16726.84
4      Australia  2011      4    421.60
..           ...   ...    ...       ...
282  Unspecified  2011      4    299.10
283  Unspecified  2011      5    852.68
284  Unspecified  2011      6    185.78
285  Unspecified  2011      7    347.35
286  Unspecified  2011      8    278.13

[287 rows x 4 columns]

In [396]:
purchases_nn = purchases_nn[purchases_nn['Price'] > 0]
purch = purchases_nn[purchases_nn['Month'] == 4].merge(purchases_nn[purchases_nn['Month'] == 10], how='left', on='Country')

In [397]:
purch['perc'] = purch['Price_y']/purch['Price_x']*100
purch.dropna(inplace=True)
purch.sort_values('perc', ascending=False)

,Country,Year_x,Month_x,Price_x,Year_y,Month_y,Price_y,perc
0,Australia,2011,4,421.60,2011.0,10.0,15643.77,3710.571632
14,Netherlands,2011,4,1155.00,2011.0,10.0,20277.92,1755.664069
19,Sweden,2011,4,486.10,2011.0,10.0,5296.96,1089.685250
8,France,2011,4,1136.30,2011.0,10.0,8895.76,782.870721
21,USA,2011,4,383.95,2011.0,10.0,1579.51,411.384295
4,Channel Islands,2011,4,293.00,2011.0,10.0,1105.16,377.187713
18,Spain,2011,4,1079.40,2011.0,10.0,3528.34,326.879748
2,Belgium,2011,4,495.24,2011.0,10.0,1491.59,301.185284
20,Switzerland,2011,4,1009.69,2011.0,10.0,2539.56,251.518783
12,Italy,2011,4,482.79,2011.0,10.0,1193.32,247.171648
1,Austria,2011,4,437.98,2011.0,10.0,1043.78,238.316818
11,Iceland,2011,4,636.25,2011.0,10.0,1294.32,203.429470
17,Singapore,2011,4,4037.77,2011.0,10.0,6068.06,150.282458
16,Portugal,2011,4,1206.29,2011.0,10.0,1578.87,130.886437
5,EIRE,2011,4,2183.82,2011.0,10.0,2856.14,130.786420
7,Finland,2011,4,642.00,2011.0,10.0,701.79,109.313084
22,United Kingdom,2011,4,21535.90,2011.0,10.0,22206.00,103.111549
9,Germany,2011,4,2221.02,2011.0,10.0,2145.38,96.594358
13,Japan,2011,4,3599.38,2011.0,10.0,1718.40,47.741555

In [398]:
#Australia, 3711

## ⭐️⭐️⭐️ Вопрос 20

Большинство клиентов все свои покупки делают из одной и той же страны. Выясним, однако, насколько велика доля путешественников среди клиентов. 
Сколько клиентов сделали покупки по крайней мере из двух разных стран? (ответ - целое число)

#### Решение

In [489]:
purch_country = purchases.groupby('CustomerID').agg({'Country' : pd.Series.unique}).reset_index()
purch_country.head(30)

    CustomerID            Country
0      12346.0     United Kingdom
1      12347.0            Iceland
2      12348.0            Finland
3      12349.0              Italy
4      12350.0             Norway
5      12352.0             Norway
6      12353.0            Bahrain
7      12354.0              Spain
8      12355.0            Bahrain
9      12356.0           Portugal
10     12357.0        Switzerland
11     12358.0            Austria
12     12359.0             Cyprus
13     12360.0            Austria
14     12361.0            Belgium
15     12362.0            Belgium
16     12363.0        Unspecified
17     12364.0            Belgium
18     12365.0             Cyprus
19     12367.0            Denmark
20     12370.0  [Cyprus, Austria]
21     12371.0        Switzerland
22     12372.0            Denmark
23     12373.0            Austria
24     12374.0            Austria
25     12375.0            Finland
26     12377.0        Switzerland
27     12378.0        Switzerland
28     12379.0            Belgium
29     12380.0            Belgium

In [525]:
purch_country['Country'].apply(pd.Series).dropna()[1].count()

8

## ⭐️⭐️⭐️ Вопрос 21

Мы запускаем в Италии рекомендательную систему "С этим товаром часто покупают...", и для этого хотим узнать, какие различные товары чаще всего встречаются в одной покупке из этой страны. Определите, какая пара различных товаров чаще всего встречается в различных покупках с ```Country=='Italy'```, и в скольких покупках это происходит. Одинаковые товары или нет, проверяйте по равенству поля Description. 

(ответ: название (Description) первого товара, название (Description) второго товара, целое число)

#### Решение